###
# mas: Mac App Store
###

mas 'Adblock Plus',     id: 1432731683
# mas 'Acorn',            id: 1547371478 # not yet purchased
mas 'Capo',             id: 696977615
mas 'Deliveries',       id: 290986013
mas 'Disk Speed Test',  id: 425264550
mas 'Donate and Smile', id: 1446974193
mas 'Forematter',       id: 1498224474
mas 'GarageBand',       id: 682658836
mas 'Keynote',          id: 409183694
mas 'Numbers',          id: 409203825
mas 'Pages',            id: 409201541
mas 'PiPifier',         id: 1160374471
mas 'Soulver',          id: 413965349
mas 'ToothFairy',       id: 1191449274
mas 'iReal Pro',        id: 409035833
# mas 'Xcode',            id: 497799835
# mas 'Gifski',           id: 1351639930
# mas 'Poolside FM',      id: 1514817810
# mas 'Tweetbot',         id: 1384080005

###
# Work Formulas
###

brew 'get-bridge/muss/muss'

###
# General Formulas
###

# C/C++ resolver library and DNS resolver utilities
brew 'adns'

# MPEG-4 command-line tool
brew 'atomicparsley'

# Tool for generating GNU Standards-compliant Makefiles
brew 'automake'

# Official Amazon AWS command-line interface
brew 'awscli'

# Light UNIX download accelerator
brew 'axel'

# Programmable completion for Bash 4.2+
brew 'bash-completion@2'

# Bash Automated Testing System
brew 'bats-core'

# Convert CD images from .bin/.cue to .iso/.cdr
brew 'bchunk'

# Remove a formula and its unused dependencies
brew 'beeftornado/rmtree/brew-rmtree'

# Audio extraction tool for sampling CDs
brew 'cdparanoia'

# Record CDs in Disk-At-Once mode
brew 'cdrdao'

# CD/DVD/Blu-ray premastering and recording software
brew 'cdrtools'

# Ruby environment tool
brew 'chruby'

# Get a file from an HTTP, HTTPS or FTP server
brew 'curl'

# GNU data recovery tool
brew 'ddrescue'

# Isolated development environments using Docker
brew 'docker-compose', link: false

# Text processing system for reStructuredText
brew 'docutils'

# Rip DVD's from the command-line
brew 'dvdbackup'

# Modern replacement for 'ls'
brew 'exa'

# Perl lib for reading and writing EXIF metadata
brew 'exiftool'

# ISO AAC audio encoder
brew 'faac'

# Simple, fast and user-friendly alternative to find
brew 'fd'

# Standalone library of the Fraunhofer FDK AAC code from Android
brew 'fdk-aac'

# Play, record, convert, and stream audio and video
brew 'ffmpeg'

# Monitor a directory for changes and run a shell command
brew 'fswatch'

# Command-line fuzzy finder written in Go
brew 'fzf'

# GitHub command-line tool
brew 'gh'

# Distributed revision control system
brew 'git'

# Prevents you from committing sensitive information to a git repo
brew 'git-secrets'

# GNU implementation of time utility
brew 'gnu-time'

# GNU Pretty Good Privacy (PGP) package
brew 'gnupg'

# Open source programming language to build simple/reliable/efficient software
brew 'go'

# GNU grep, egrep and fgrep
brew 'grep'

# Popular GNU data compression program
brew 'gzip'

# Everything you need to get started with Heroku
brew 'heroku/brew/heroku'

# Improved top (interactive process viewer)
brew 'htop'

# Lightweight and flexible command-line JSON processor
brew 'jq'

# Kubernetes CLI To Manage Your Clusters In Style!
brew 'k9s'

# Implements the Advanced Access Content System specification
brew 'libaacs'

# Compact Disc Input and Control Library
brew 'libcdio'

# Apache Pulsar C++ library
brew 'libpulsar'

# XML security library
brew 'libxmlsec1'

# Move files and folders to the trash
brew 'macos-trash'

# Mac App Store command-line interface
brew 'mas'

# Recursively compute digests on files/directories
brew 'md5deep'

# Replacement for ls, cp and other commands for object storage
brew 'minio-mc'

# Port scanning utility for large networks
brew 'nmap'

# 7-Zip (high compression file archiver) implementation
brew 'p7zip'

# Swiss-army knife of markup format conversion
brew 'pandoc'

# Shell command parallelization utility
brew 'parallel'

# Parallel gzip
brew 'pigz'

# Object-relational database system
brew 'postgresql@9.5'

# Coreutils progress viewer
brew 'progress'

# Monitor data's progress through a pipe
brew 'pv'

# Reattach process (e.g., tmux) to background
brew 'reattach-to-user-namespace'

# Search tool like grep and The Silver Searcher
brew 'ripgrep'

# Install various Ruby versions and implementations
brew 'ruby-build'

# Safe, concurrent, practical language
brew 'rust'

# Low-level access to audio, keyboard, mouse, joystick and graphics
brew 'sdl'

# Database of common MIME types
brew 'shared-mime-info'

# Static analysis and lint tool, for (ba)sh scripts
brew 'shellcheck'

# Command-line interface for https://speedtest.net bandwidth tests
brew 'speedtest-cli'

# Version control system designed to be a better CVS
brew 'subversion'

# SWF manipulation and generation tools
brew 'swftools'

# Convert TeXinfo files to HTML
brew 'texi2html'

# Terraform version manager inspired by rbenv
brew 'tfenv'

# Linter for Terraform files
brew 'tflint'

# Programmatically correct mistyped console commands
brew 'thefuck'

# Terminal multiplexer
brew 'tmux'

# Display directories as trees (with optional color/HTML output)
brew 'tree'

# Maintained ctags implementation
brew 'universal-ctags/universal-ctags/universal-ctags'

# Extraction utility for .zip compressed archives
brew 'unzip'

# Allows the secure storage and execution of environments
brew 'vaulted'

# Vi 'workalike' with many additional features
brew 'vim'

# Executes a program periodically, showing output fullscreen
brew 'watch'

# Internet file retriever
brew 'wget'

# Whalebrew creates aliases for Docker images so you can run
# them as if they were native commands.
# It's like Homebrew, but with Docker images.
brew 'whalebrew'

# Linter for YAML files
brew 'yamllint'

# JavaScript package manager
brew 'yarn'

# Modular BSD reimplementation of NASM
brew 'yasm'

# Download YouTube videos from the command-line
brew 'youtube-dl'


# Casks
cask '1password'
cask 'carbon-copy-cloner'
cask 'daisydisk'
cask 'dash'
cask 'discord'
cask 'disk-arbitrator'
# cask 'docker' # TODO: I didn't feel like blowing up my existing config
cask 'dozer' # menubar utility
cask 'keka'
cask 'kitty' # terminal
cask 'mkvtoolnix'
cask 'numi' # calculator
cask 'plexamp'
cask 'slack'
cask 'sublime-text'
cask 'virtualbox'
cask 'vlc'
cask 'xld'

# Application for inspecting installer packages
# https://www.mothersruin.com/software/SuspiciousPackage/
cask 'suspicious-package'

###
# Font Faces
###
cask 'font-atkinson-hyperlegible'
cask 'font-fantasque-sans-mono'
cask 'font-fira-code'
cask 'font-ibm-plex'
cask 'font-iosevka'
cask 'font-iosevka-slab'
cask 'font-monofur-for-powerline'
cask 'font-source-code-pro'

###
# Quicklook Plugins
###
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'

###
# Whalebrew
###

# None

###
# Other Applications kept for reference
###

# Java
# cask 'adoptopenjdk8'

# Alacritty TTY
# cask 'alacritty'

# GraphQL clients
# cask 'altair-graphql-client'
# cask 'graphiql'

# Benchmarking
# cask 'cinebench'
# cask 'geekbench'

# VS Code
# cask 'visual-studio-code'
