nektos/tap/act
ansible
ascii
automake
awscli
bash
bash-completion
chruby
cloc
coffeescript
ctags
curl
ddrescue
dive
dmg2img
dvdbackup
e2fsprogs
exa
exercism
f3
fd
ffmpeg
discoteq/discoteq/flock
fn
fswatch
fzf
gh
git
git-secrets
gnu-time
gnupg
go
goby-lang/goby/goby
golangci/tap/golangci-lint
gzip
helm
heroku/brew/heroku
htop
isl
jq
k9s
libav
libev
libmpc
libxmlsec1
macos-trash
mas
md5deep
minio-mc
mtr
ncdu
nmap
packer
parallel
pigz
postgresql
postgresql@10
postgresql@11
postgresql@9.5
progress
pv
pyenv
quilt
rdfind
reattach-to-user-namespace
redis
ripgrep
rsync
ruby-build
rust
shellcheck
socat
speedtest-cli
tfenv
tflint
thefuck
djbender/tmux/tmux@2.9
travis
tree
ufraw
unzip
vaulted
vim
saulpw/vd/visidata
watch
wget
yamllint
yarn
yasm
youtube-dl
